In [5]:
import numpy as np

In [8]:
import pandas as pd
from numpy.random import randn

In [9]:
df=pd.DataFrame(randn(5,4),index=['A','B','C','D','E'],columns='W X Y Z'.split())

In [10]:
df

          W         X         Y         Z
A -0.831956 -0.452503 -1.663088  0.315434
B  0.214365 -0.437490  0.858193 -1.126852
C -0.345286  1.189312  1.337261  0.487686
D  0.429170  0.564055 -0.680975 -0.257880
E -1.425865 -0.224303 -0.662786 -2.042458

In [11]:
df['W']

A   -0.831956
B    0.214365
C   -0.345286
D    0.429170
E   -1.425865
Name: W, dtype: float64

In [12]:
df['X']

A   -0.452503
B   -0.437490
C    1.189312
D    0.564055
E   -0.224303
Name: X, dtype: float64

In [13]:
df['Y']

A   -1.663088
B    0.858193
C    1.337261
D   -0.680975
E   -0.662786
Name: Y, dtype: float64

In [14]:
df[['W','X']]

          W         X
A -0.831956 -0.452503
B  0.214365 -0.437490
C -0.345286  1.189312
D  0.429170  0.564055
E -1.425865 -0.224303

In [15]:
type(df['W'])

pandas.core.series.Series

In [16]:
df.W

A   -0.831956
B    0.214365
C   -0.345286
D    0.429170
E   -1.425865
Name: W, dtype: float64

In [18]:
df.X

A   -0.452503
B   -0.437490
C    1.189312
D    0.564055
E   -0.224303
Name: X, dtype: float64

In [20]:
df.loc[['A']]

          W         X         Y         Z
A -0.831956 -0.452503 -1.663088  0.315434

In [21]:
df.loc[['A','B']]

          W         X         Y         Z
A -0.831956 -0.452503 -1.663088  0.315434
B  0.214365 -0.437490  0.858193 -1.126852

In [22]:
df.iloc[[3,4]]

          W         X         Y         Z
D  0.429170  0.564055 -0.680975 -0.257880
E -1.425865 -0.224303 -0.662786 -2.042458

In [24]:
df['new']=df['X']+10

In [25]:
df

          W         X         Y         Z        new
A -0.831956 -0.452503 -1.663088  0.315434   9.547497
B  0.214365 -0.437490  0.858193 -1.126852   9.562510
C -0.345286  1.189312  1.337261  0.487686  11.189312
D  0.429170  0.564055 -0.680975 -0.257880  10.564055
E -1.425865 -0.224303 -0.662786 -2.042458   9.775697

In [34]:
df.drop('new',axis=1,inplace=True)

In [38]:
df.drop('C',axis=0)

          W         X         Y         Z
A -0.831956 -0.452503 -1.663088  0.315434
B  0.214365 -0.437490  0.858193 -1.126852
D  0.429170  0.564055 -0.680975 -0.257880
E -1.425865 -0.224303 -0.662786 -2.042458

In [39]:
df

          W         X         Y         Z
A -0.831956 -0.452503 -1.663088  0.315434
B  0.214365 -0.437490  0.858193 -1.126852
C -0.345286  1.189312  1.337261  0.487686
D  0.429170  0.564055 -0.680975 -0.257880
E -1.425865 -0.224303 -0.662786 -2.042458

In [40]:
df.drop('C',axis=0,inplace=True)

In [42]:
df>0

       W      X      Y      Z
A  False  False  False   True
B   True  False   True  False
D   True   True  False  False
E  False  False  False  False